package main

import "fmt"

var p = func (v float32) {
	fmt.Printf("%v\n", v)
}

var p2 = func (v float64) {
	fmt.Printf("%v\n", v)
}

/*
単精度浮動小数点型(float32)は倍精度浮動小数点型の半分の数の数値しか表現できない。
基本的に倍精度小数点型を使うようにする。
 */

func main() {
	p(float32(1.0000000)) // 1
	p(float32(1.0000001)) // 1.000001
	p(float32(1.0000002)) // 1.000002
	p(float32(1.0000003)) // 1.000003ではなく、1.000004
	p(float32(1.0000002) + float32(0.0000001) ) // 1.000003ではなく、1.000004
	p(float32(1.0000004))
	p(float32(1.0000005))
	p(float32(1.0000006))
	p(float32(1.0000007))
	p(float32(1.0000008))
	p(float32(1.0000009)) // 1.000001

	println("-------------------------------------------")

	p2(float64(1.0000000)) // 1
	p2(float64(1.0000001)) // 1.000001
	p2(float64(1.0000002)) // 1.000002
	p2(float64(1.0000003)) // 1.000003
	p2(float64(1.0000002) + float64(0.0000001) ) // 1.000003
	p2(float64(1.0000004))
	p2(float64(1.0000005))
	p2(float64(1.0000006))
	p2(float64(1.0000007))
	p2(float64(1.0000008))
	p2(float64(1.0000009)) // 1.000009
}
